app/Controllers/Admin.php

SELECT *
FROM `peserta`
WHERE `peserta_id` = '17'
 LIMIT 1
---
    public function index(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();

SELECT *
FROM `santri`
ORDER BY `created_at` DESC
SELECT *
FROM `peserta`
WHERE `peserta`.`peserta_id` = '30'
---
    public function santri($cond = ''): string
    {
        $data = [
            'title' => 'Daftar Calon Santri',
            'page' => 'admin-santri',
        ];

        $santriModel = $this->santriModel;

        $keyword = $this->request->getGet('keyword') ?? '';

        $santriQuery = $santriModel->orderBy('created_at', 'DESC');

        if (!empty($keyword)) {
            $santriQuery->groupStart()->like('santri_nama', $keyword)->orLike('santri_nik', $keyword)->groupEnd();
        }

        $santriData = $santriQuery->findAll();

        $pesertaModel = $this->pesertaModel;
        $ortuModel = $this->ortuModel;
        $rkModel = $this->riwayatKesehatanModel;
        $bpModel = $this->bpModel;
        $ttModel = $this->ttModel;
        $twModel = $this->twModel;
        $pengumumanModel = $this->pengumumanModel;

        foreach ($santriData as $key => $x) {
            $santriData[$key]['peserta_nama'] = $pesertaModel->find($x['peserta_id'])['peserta_nama'] ?? 0;
            $santriData[$key]['peserta_created_at'] = $pesertaModel->find($x['peserta_id'])['created_at'] ?? 0;

SELECT `santri`.*, `testulis`.*, `bp`.*
FROM `santri`
JOIN `bp` ON `bp`.`peserta_id` = `santri`.`peserta_id`
JOIN `testulis` ON `testulis`.`peserta_id` = `santri`.`peserta_id`
WHERE `santri`.`santri_saved` = '1'
AND `bp`.`bp_konfirm` = '1'
AND `testulis`.`testulis_konfirm` = '0'
ORDER BY `santri`.`created_at` DESC
---
            ->orderBy('santri.created_at', 'DESC')
            ->findAll();
        } elseif ($cond == 'all') {
            $santriData = $santriModel
            ->select('santri.*, testulis.*, teswawancara.*, bp.bp_saved, bp.bp_konfirm, bp.bp_foto, bp.bp_bp')
            ->join('bp', 'bp.peserta_id = santri.peserta_id')
            ->join('teswawancara', 'teswawancara.peserta_id = santri.peserta_id')
            ->join('testulis', 'testulis.peserta_id = santri.peserta_id')
            ->where('santri.santri_saved', '1')
            ->where('testulis.testulis_konfirm', '1')
            ->orderBy('santri.created_at', 'DESC')
            ->findAll();