app/Controllers/Admin.php

    public function __construct()
    {
        $this->pesertaModel = new PesertaModel();
        $this->santriModel = new SantriModel();
        $this->ortuModel = new OrtuModel();
        $this->riwayatKesehatanModel = new RiwayatKesehatanModel();
        $this->lainModel = new LainModel();
        $this->bpModel = new BpModel();
        $this->ttModel = new TesTulisModel();
        $this->twModel = new TeswawancaraModel();
        $this->messageModel = new MessageModel();
        $this->pengumumanModel = new PengumumanModel();
        $this->periodeModel = new PeriodeModel();

        if (session()->get('periode') !== null) {
            $this->periode_mulai = session()->get('periode')['mulai'];
            $this->periode_selesai = session()->get('periode')['selesai'];
            $this->jumlah_peserta = $this->pesertaModel->where('created_at >=', $this->periode_mulai . ' 00:00:00')->where('created_at <=', $this->periode_selesai . ' 23:59:59')->countAllResults();
            $this->jumlah_peserta_lulus =
            $this->pesertaModel
            ->where('peserta.created_at >=', $this->periode_mulai . ' 00:00:00')->where('peserta.created_at <=', $this->periode_selesai . ' 23:59:59')
            ->where('pengumuman.pengumuman_status', 1)
            ->join('pengumuman', 'peserta.peserta_id = pengumuman.peserta_id')
            ->countAllResults();
        } else {
            $this->periode_mulai = '';
            $this->periode_selesai = '';
            $this->jumlah_peserta = $this->pesertaModel->countAllResults();
            $this->jumlah_peserta_lulus =
            $this->pesertaModel
            ->where('pengumuman.pengumuman_status', 1)
            ->join('pengumuman', 'peserta.peserta_id = pengumuman.peserta_id')
            ->countAllResults();
        }

        $this->periode_now = $this->periodeModel
        ->where('periode_mulai <=', date('Y-m-d'))
        ->where('periode_selesai >=', date('Y-m-d'))
        ->first();
---
SELECT COUNT(*) AS `numrows`
FROM `peserta`
WHERE `created_at` >= '2025-01-01 00:00:00 00:00:00'
AND `created_at` <= '2025-12-12 23:59:59 23:59:59'
SELECT COUNT(*) AS `numrows`
FROM `peserta`
JOIN `pengumuman` ON `peserta`.`peserta_id` = `pengumuman`.`peserta_id`
WHERE `peserta`.`created_at` >= '2025-01-01 00:00:00 00:00:00'
AND `peserta`.`created_at` <= '2025-12-12 23:59:59 23:59:59'
AND `pengumuman`.`pengumuman_status` = 1
SELECT COUNT(*) AS `numrows`
FROM `peserta`
SELECT COUNT(*) AS `numrows`
FROM `peserta`
JOIN `pengumuman` ON `peserta`.`peserta_id` = `pengumuman`.`peserta_id`
WHERE `pengumuman`.`pengumuman_status` = 1
SELECT *
FROM `periode`
WHERE `periode_mulai` <= '2025-02-20'
AND `periode_selesai` >= '2025-02-20'
 LIMIT 1

    public function periode(): string
    {
        $data = [
            'title' => 'Periode Penerimaan',
            'page' => 'admin-periode',
            'periode_now' => $this->periode_now,
            'jumlah_peserta' => $this->jumlah_peserta,
            'jumlah_peserta_lulus' => $this->jumlah_peserta_lulus
        ];

        $periodeModel = $this->periodeModel;
        $periodeData = $periodeModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `periode`
ORDER BY `created_at` DESC

    public function cog(): string
    {
        $data = [
            'title' => 'Konfigurasi Utama',
            'page' => 'admin-cog',
            'periode_now' => $this->periode_now,
            'jumlah_peserta' => $this->jumlah_peserta,
            'jumlah_peserta_lulus' => $this->jumlah_peserta_lulus
        ];

        $periodeModel = $this->periodeModel;
        $periodeData = $periodeModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `periode`
ORDER BY `created_at` DESC