app/Controllers/Admin.php

    public function santri(): string
    {
        $data = [
            'title' => 'Daftar Calon Santri',
            'page' => 'admin-santri',
        ];

        $santriModel = $this->santriModel;
        $santriData = $santriModel->orderBy('created_at', 'DESC')->where('santri_saved', '1')->findAll();
---
SELECT *
FROM `santri`
WHERE `santri_saved` = '1'
ORDER BY `created_at` DESC