app/Controllers/Auth.php

    public function masuk_auth()
    {
        $rules = [
            'username' => 'required',
            'pass' => 'required'
        ];

        $errors = [
            'username' => [
                'required' => 'Username harus diisi.'
            ],
            'pass' => [
                'required' => 'Password harus diisi.'
            ]
        ];

        if (!$this->validate($rules, $errors)) {
            session()->setFlashdata('errors-masuk', $this->validator->getErrors());
            return redirect()->to('masuk')->withInput();
        }

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('pass');

        if (str_starts_with($username, '08')) {
            $username = '628' . substr($username, 2);
        }

        $peserta = $this->pesertaModel->where('peserta_username', $username)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_username` = '6281224088230'
 LIMIT 1