app/Controllers/Guest.php

    public function index(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_id` IS NULL
 LIMIT 1