app/Controllers/Ortu.php

UPDATE `ortu` SET `ortu_a_nama` = 'Budi Arie', `ortu_a_pekerjaan` = '13', `ortu_a_pekerjaan_lain` = 'Politikus', `ortu_a_agama` = '2', `ortu_a_agama_lain` = '', `ortu_a_pendidikan` = '16', `ortu_a_pendidikan_lain` = '', `ortu_a_hp` = '62812238999200', `ortu_a_pendapatan` = '9.000.000', `ortu_i_nama` = 'Siti Romlah', `ortu_i_pekerjaan` = '1', `ortu_i_pekerjaan_lain` = '', `ortu_i_agama` = '1', `ortu_i_agama_lain` = '', `ortu_i_pendidikan` = '16', `ortu_i_pendidikan_lain` = '', `ortu_i_hp` = '6287608505228', `ortu_i_pendapatan` = '-', `ortu_saved` = '1', `updated_at` = '2025-02-08 22:54:32'
WHERE `ortu`.`ortu_id` IN ('13')
---

        $ortu_id = $this->request->getPost('ortu_id');
        $ortuModel = $this->ortuModel;
        $ortuModel->update($ortu_id, $update);