app/Controllers/User.php

SELECT *
FROM `peserta`
WHERE `peserta_id` = '23'
 LIMIT 1
---
    public function pengumuman(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();