app/Controllers/User.php

    public function index(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_id` = '29'
 LIMIT 1

    public function biodata_orang_tua(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_id` = '17'
 LIMIT 1

    public function tes_tulis(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_id` = '17'
 LIMIT 1

    public function tes_wawancara(): string
    {
        $session_id = session()->get('peserta_id');
        $user = $this->pesertaModel->where('peserta_id', $session_id)->first();
---
SELECT *
FROM `peserta`
WHERE `peserta_id` = '20'
 LIMIT 1