app/Models/LainModel.php

    public function getLainByIdPeserta($peserta_id)
    {
        $builder = $this->builder();
        $lainData = $builder->where('peserta_id', $peserta_id)->get()->getRowArray();

        if ($lainData) {
            // Ambil data dari tabel lain_prestasi berdasarkan lain_id
            $lainPrestasiModel = new \App\Models\LainPrestasiModel();
            $lainData['lain_prestasi'] = $lainPrestasiModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_organisasi berdasarkan lain_id
            $lainOrganisasiModel = new \App\Models\LainOrganisasiModel();
            $lainData['lain_organisasi'] = $lainOrganisasiModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_bahasa berdasarkan lain_id
            $lainBahasaModel = new \App\Models\LainBahasaModel();
            $lainData['lain_bahasa'] = $lainBahasaModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_keahlian berdasarkan lain_id
            $lainKeahlianModel = new \App\Models\LainKeahlianModel();
            $lainData['lain_keahlian'] = $lainKeahlianModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_olahraga berdasarkan lain_id
            $lainOlahragaModel = new \App\Models\LainOlahragaModel();
            $lainData['lain_olahraga'] = $lainOlahragaModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_senbud berdasarkan lain_id
            $lainSenbudModel = new \App\Models\LainSenbudModel();
            $lainData['lain_senbud'] = $lainSenbudModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_penalaran berdasarkan lain_id
            $lainPenalaranModel = new \App\Models\LainPenalaranModel();
            $lainData['lain_penalaran'] = $lainPenalaranModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_agama berdasarkan lain_id
            $lainAgamaModel = new \App\Models\LainAgamaModel();
            $lainData['lain_agama'] = $lainAgamaModel->where('lain_id_lain', $lainData['lain_id'])->findAll();

            // Ambil data dari tabel lain_bahasam berdasarkan lain_id
            $lainBahasamModel = new \App\Models\LainBahasamModel();
            $lainData['lain_bahasam'] = $lainBahasamModel->where('lain_id_lain', $lainData['lain_id'])->findAll();
---
SELECT *
FROM `lain`
WHERE `peserta_id` = '19'
SELECT *
FROM `lain_prestasi`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_organisasi`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_bahasa`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_keahlian`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_olahraga`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_senbud`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_penalaran`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_agama`
WHERE `lain_id_lain` = '6'
SELECT *
FROM `lain_bahasam`
WHERE `lain_id_lain` = '6'