app/Models/MessageModel.php

SELECT *
FROM `message`
WHERE `peserta_id` = '29'
 LIMIT 1
---
    public function getMessageByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();