app/Models/OrtuModel.php

    public function getOrtuByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();
---
SELECT *
FROM `ortu`
WHERE `peserta_id` = '19'
 LIMIT 1