app/Models/PengumumanModel.php

    public function getPengumumanByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();
---
SELECT *
FROM `pengumuman`
WHERE `peserta_id` = '30'
 LIMIT 1