app/Models/RiwayatKesehatanModel.php

SELECT *
FROM `riwayatkesehatan`
WHERE `peserta_id` = '19'
 LIMIT 1
SELECT *
FROM `rk_penyakit_pernah_dialami`
WHERE `rk_id` = '10'
SELECT *
FROM `rk_penyakit_sedang_dialami`
WHERE `rk_id` = '10'
---
    public function getRiwayatKesehatanByIdPeserta($peserta_id)
    {
        $riwayat = $this->where('peserta_id', $peserta_id)->first();

        if (!$riwayat) {
            return null;
        }

        $riwayat['penyakit_pernah'] = $this->db->table('rk_penyakit_pernah_dialami')
            ->where('rk_id', $riwayat['rk_id'])
            ->get()
            ->getResultArray();

        $riwayat['penyakit_sedang'] = $this->db->table('rk_penyakit_sedang_dialami')
            ->where('rk_id', $riwayat['rk_id'])
            ->get()
            ->getResultArray();