app/Models/SantriModel.php

SELECT *
FROM `santri`
WHERE `peserta_id` = '19'
 LIMIT 1
---
    public function getSantriByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();