app/Models/TesTulisModel.php

SELECT *
FROM `testulis`
WHERE `peserta_id` = '19'
 LIMIT 1
---
    public function getTtByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();