app/Models/TesWawancaraModel.php

    public function getTwByPesertaId($peserta_id)
    {
        return $this->where('peserta_id', $peserta_id)->first();
---
SELECT *
FROM `teswawancara`
WHERE `peserta_id` = '19'
 LIMIT 1